[
    [
        {
            "title": "Safaricom Telecom Job Vacancy 2023",
            "url": "https://effoysira.com/safaricom-telecommunications-vacancy-2023/",
            "date": "OCTOBER 4, 2023",
            "from": "EFFOY",
            "content": "Safaricom Telecommunications Ethiopia Vacancy Announcement: Safaricom Ethiopia is looking for a qualified person who meets the criteria indicated below. Safaricom Ethiopia is owned by an international consortium including Vodafone Group; Safaricom PLC; Vodacom Group; Sumitomo Corporation – one of the…"
        },
        {
            "title": "Ethiopian Skylight Vacancy IT Officer",
            "url": "https://effoysira.com/ethiopian-skylight-vacancy-it-officer/",
            "date": "OCTOBER 4, 2023",
            "from": "EFFOY",
            "content": "Ethiopian Skylight Hotel invites qualified applicants for the following job position. Ethiopian Skylight Hotel is a striking contemporary property with elegant design and outstanding facilities in a prime location just 5 minutes´ walk away from the Addis Ababa Bole International…"
        },
        {
            "title": "Embassy of Brazil Vacancy 2023",
            "url": "https://effoysira.com/embassy-of-brazil-vacancy-2023/",
            "date": "OCTOBER 4, 2023",
            "from": "EFFOY",
            "content": "This offer intends to hire one Administrative Assistant to provide support to the Embassy’s Chancery and Residence. Position: Administrative Assistant Desired additional skills and competencies: The candidate must: How to Apply: REGISTRATION Those interested in applying must forward the required…"
        },
        {
            "title": "American College of Technology Vacancy",
            "url": "https://effoysira.com/american-college-of-technology-vacancy/",
            "date": "OCTOBER 2, 2023",
            "from": "EFFOY",
            "content": "American College of Technology (ACT) invites fresh graduates for the following job position. Mesirat is a five-year programme financed by Mastercard Foundation in partnership with Gebaya. The programme targets to reach 2 million beneficiaries, out of which 1 million are…"
        },
        {
            "title": "Ethiopian Airlines Group Vacancy | Auditor",
            "url": "https://effoysira.com/ethiopian-airlines-group-vacancy-auditor/",
            "date": "OCTOBER 2, 2023",
            "from": "EFFOY",
            "content": "Ethiopian Airlines Group would like to announce a new vacant position in the capacity of Assistant Inventory Auditor. Ethiopian Airlines (Ethiopian) has had more than 75 years of successful journey which made it the leading Aviation Group in Africa. Of course,…"
        },
        {
            "title": "Ethiopian Airlines Vacancy Par-Time Instructors",
            "url": "https://effoysira.com/ethiopian-airlines-vacancy-par-time-instructors/",
            "date": "SEPTEMBER 29, 2023",
            "from": "EFFOY",
            "content": "Ethiopian Airlines Group would like to announce a new vacant position in the capacity of Par-Time Instructors. Position 1: Par-Time Instructor- Engineering Drawing I QUALIFICATION REQUIREMENTS: Ph.D. degree in engineering or a related field, and relevant experience in engineering graphics and…"
        },
        {
            "title": "Dangote Cement Vacancy 2023",
            "url": "https://effoysira.com/dangote-cement-vacancy-2023/",
            "date": "SEPTEMBER 29, 2023",
            "from": "EFFOY",
            "content": "Dangote Cement Plc is Sub-Saharan Africa’s leading cement company, with a production capacity of 51.6 million tonnes per year across ten countries. Together, these operations make us the largest cement producer in Sub-Saharan Africa. The 2.5Mta plant, less than 90km…"
        },
        {
            "title": "Aggar Micro Finance Job Vacancy 2023",
            "url": "https://effoysira.com/aggar-micro-finance-job-vacancy-2023/",
            "date": "SEPTEMBER 26, 2023",
            "from": "EFFOY",
            "content": "Aggar MFI is the first Commercial private Microfinance established in accordance with proclamation No 40/96 which is currently replaced by proclamation No.626/2009 to serve the “missing middle” to provide credit and saving services in urban and rural areas of the…"
        },
        {
            "title": "Ethio-Djibouti Railway S.C Vacancy 2023",
            "url": "https://effoysira.com/ethio-djibouti-railway-s-c-vacancy-2023/",
            "date": "SEPTEMBER 26, 2023",
            "from": "EFFOY",
            "content": "Ethio-Djibouti Railway Standard Gauge Share Company  External Vacancy Announcement Ethio-Djibouti Standard Gauge Railway Share Company (or Shortly Ethio-Djibouti Railway (EDR)) was established in April 2017, based on the Bilateral Agreement signed on 16th of December 2016 between the two states,…"
        }
    ],
    [
        {
            "title": "Yemisrach Microfinance Vacancy 2023",
            "url": "https://effoysira.com/yemisrach-microfinance-vacancy-2023/",
            "date": "SEPTEMBER 26, 2023",
            "from": "EFFOY",
            "content": "Yemisrach Micro Finance S.C (YMF S.C) is a microfinance institution established as per proclamation No. 626/2009 and licensed from NBE in July 2018. Currently, it has 2542 shareholders and operates in Addis Ababa, Oromia, Sidama, and SNNP regions. It has…"
        },
        {
            "title": "Nisir Micro Finance Vacancy 2023",
            "url": "https://effoysira.com/nisir-micro-finance-vacancy-2023/",
            "date": "SEPTEMBER 26, 2023",
            "from": "EFFOY",
            "content": "Nisir Microfinance Institution S.C External Vacancy Announcement Nisir Microfinance Institution S.C is one of the pioneering financial service providers in Ethiopia focusing on serving Micro, Small and Medium Size Enterprises. Supported by its Core Banking System, Nisir provides ranges of credit…"
        },
        {
            "title": "Meklit Microfinance Vacancy 2023",
            "url": "https://effoysira.com/meklit-microfinance-vacancy-2023/",
            "date": "SEPTEMBER 25, 2023",
            "from": "EFFOY",
            "content": "Meklit Microfinance Institution S.C is a transformed Commercial Microfinance institution S.C initially established according to proclamation no. 40/96 and recently revised proclamation 626/2009 issued by National Bank Of Ethiopia to provide financial and non-financial services to Medium, Small Enterprise and …"
        },
        {
            "title": "Embassy of Ireland Job Vacancy 2023",
            "url": "https://effoysira.com/embassy-of-ireland-job-vacancy-2023/",
            "date": "SEPTEMBER 25, 2023",
            "from": "EFFOY",
            "content": "Embassy of Ireland invites qualified applicants for the following job position. Ireland has enjoyed bilateral relations with Ethiopia since 1994, when its Embassy in Addis Ababa was first opened. Ireland’s engagement in Ethiopia is guided by the Government of Ireland’s…"
        },
        {
            "title": "Coca Cola Job Vacancy Sept 2023",
            "url": "https://effoysira.com/coca-cola-job-vacancy-sept-2023/",
            "date": "SEPTEMBER 19, 2023",
            "from": "EFFOY",
            "content": "East Africa Bottling Share Company ( EABSC) works with the world’s most cherished trademark; invests in the most sophisticated production system in the world and employ people who are prepared to work with passion and focus. East Africa Bottling SC…"
        },
        {
            "title": "Neo Microfinance Job Vacancy 2023",
            "url": "https://effoysira.com/neo-microfinance-job-vacancy-2023/",
            "date": "SEPTEMBER 19, 2023",
            "from": "EFFOY",
            "content": "Neo Microfinance Institution S.C invite interested and qualified applicants for the following job positions. NEO Microfinance, “NEO”, is an Ethiopian Microfinance Institution (MFI) under formation that has fulfilled all the prerequisites of the National Bank of Ethiopia’s regulatory requirements necessary…"
        },
        {
            "title": "Ethiopian Railways Corporation Vacancy 2023",
            "url": "https://effoysira.com/ethiopian-railways-corporation-vacancy-2023/",
            "date": "SEPTEMBER 19, 2023",
            "from": "EFFOY",
            "content": "Ethiopian Railways Corporation invites Fresh graduates and qualified candidates for the following positions. Ethiopian Railway, commonly known as ER, full name Ethiopian Railway Corporation, is the national railway operator of the Federal Democratic Republic of Ethiopia, under the regulation of…"
        },
        {
            "title": "Jobs by Saudia Arabian Airlines",
            "url": "https://effoysira.com/jobs-by-saudia-arabian-airlines/",
            "date": "SEPTEMBER 18, 2023",
            "from": "EFFOY",
            "content": "Saudia Arabian Airlines Job Vacancy 2023, Saudia Arabian Airlines. SAUDIA is the first founded airline in the Arabian peninsula. It started in 1945 with one DC-3, and since then it has marched forward towards excellence recording the highest level of…"
        },
        {
            "title": "Ethiopian Skylight Hotel Vacancy Sept 2023",
            "url": "https://effoysira.com/ethiopian-skylight-hotel-vacancy-aug-2023/",
            "date": "SEPTEMBER 14, 2023",
            "from": "EFFOY",
            "content": "Ethiopian Skylight Hotel invites qualified applicants for the following job position. Ethiopian Skylight Hotel is a striking contemporary property with elegant design and outstanding facilities in a prime location just 5 minutes´ walk away from the Addis Ababa Bole International…"
        }
    ],
    [
        {
            "title": "Germany Embassy Job Vacancy 2023",
            "url": "https://effoysira.com/germany-embassy-job-vacancy-2023/",
            "date": "SEPTEMBER 14, 2023",
            "from": "EFFOY",
            "content": "The Embassy of the Federal Republic of Germany in Addis Ababa seeks to recruit two suitably qualified candidates for Assistant Clerks Position. Position: Assistant Clerks ( At the Visa and Consular Section ) The applicant should possess the following minimum…"
        },
        {
            "title": "British Embassy Vacancy | Internship",
            "url": "https://effoysira.com/british-embassy-vacancy-internship/",
            "date": "SEPTEMBER 14, 2023",
            "from": "EFFOY",
            "content": "The British Government is an inclusive and diversity-friendly employer.  We value difference, promote equality and challenge discrimination, enhancing our organizational capability. We welcome and encourage applications from people of all backgrounds. We do not discriminate on the basis of disability,…"
        },
        {
            "title": "Harbu Microfinance Job Vacancy 2023",
            "url": "https://effoysira.com/harbu-microfinance-job-vacancy-2023/",
            "date": "SEPTEMBER 11, 2023",
            "from": "EFFOY",
            "content": "Harbu Microfinance Institution invites fresh and qualified applicants for the following job positions. Harbu Micro Finance Institution: Established in 2005 and is affiliated to Facilitator for Change (NGO). Harbu MFI aims at boosting agricultural productivity and agricultural marketing by supporting…"
        },
        {
            "title": "SafariCom Ethiopia Vacancy Sept 2023",
            "url": "https://effoysira.com/safaricom-ethiopia-vacancy-sept-2023/",
            "date": "SEPTEMBER 9, 2023",
            "from": "EFFOY",
            "content": "We are pleased to announce the following position within the Technology Function.  In keeping with our current business needs, we are looking for a person who meets the criteria indicated below. Position 1: Senior Accountant Tax (Internal/External) Education & Experience: Role purpose:…"
        },
        {
            "title": "Coca Cola Job Vacancy 2023",
            "url": "https://effoysira.com/coca-cola-job-vacancy-2023/",
            "date": "SEPTEMBER 7, 2023",
            "from": "EFFOY",
            "content": "An exciting vacant position has arisen at East Africa Bottling Share Company for the role of Team Leader-Distribution and Settlement Team Leader. East Africa Bottling Share Company ( EABSC) works with the world’s most cherished trademark; invests in the most…"
        },
        {
            "title": "VisionFund Micro Finance Vacancy 2023",
            "url": "https://effoysira.com/visionfund-micro-finance-vacancy-2023/",
            "date": "SEPTEMBER 7, 2023",
            "from": "EFFOY",
            "content": "VisionFund Micro Finance Institution (S.C) is an Institution established according to proclamation No. 40/96 to provide financial services to the productive poor in the rural and urban areas of Ethiopia. VisionFund is currently operating in four of the Regional States…"
        },
        {
            "title": "Wallet Microfinance Institution Vacancy 2023",
            "url": "https://effoysira.com/wallet-microfinance-institution-vacancy-2023/",
            "date": "SEPTEMBER 4, 2023",
            "from": "EFFOY",
            "content": "Wallet Microfinance Institution Share Company Vacancy invites qualified  applicants for the various positions. W Microfin Ethiopia is invites job seekers for appointment. The Wallet Microfinance Institution Share Company Vacancy is an institution providing financial and related non-financial services to the…"
        },
        {
            "title": "Coca Cola Job Vacancy – Maintenance Controller",
            "url": "https://effoysira.com/coca-cola-job-vacancy-maintenance-controller/",
            "date": "SEPTEMBER 2, 2023",
            "from": "EFFOY",
            "content": "East Africa Bottling S.C., a subsidiary of Coca-Cola Beverages Africa, works with the world’s most cherished trademark, and invest in the most sophisticated production system in the world. Currently, we have an exciting opportunity for the role of Maintenance Controller and…"
        },
        {
            "title": "Sheger Microfinance Job Vacancy 2023",
            "url": "https://effoysira.com/sheger-microfinance-vacancy-2023/",
            "date": "AUGUST 31, 2023",
            "from": "EFFOY",
            "content": "Sheger Microfinance Institution invites Fresh and qualified applicants for the following positions. Sheger microfinance S.C is a Mass based finance institution established in accordance with the pertinent laws, regulations, and proclamations governing micro finance business in Ethiopian commercial code. It…"
        }
    ],
    [
        {
            "title": "American Embassy Vacancy 2023",
            "url": "https://effoysira.com/american-embassy-vacancy-2023/",
            "date": "AUGUST 25, 2023",
            "from": "EFFOY",
            "content": "The U.S. Mission in Addis Ababa/Ethiopia is seeking eligible and qualified applicants for the position of Logistics Team Lead Assistant. The U.S. Mission provides equal opportunity and fair and equitable treatment in employment to all people without regard to race,…"
        },
        {
            "title": "Job Opening at Ethiopian Sky Technologies",
            "url": "https://effoysira.com/job-openings-at-ethiopian-sky-technologies/",
            "date": "AUGUST 25, 2023",
            "from": "EFFOY",
            "content": "Job Opening at Ethiopian Sky Technologies, It is a Joint Venture (JV) company of Ethiopian Airlines and Sky techno of Italy; which is engaged in manufacture insulation blankets and its primary manufacturing facility is at Bole Airport, Addis Ababa. Products…"
        },
        {
            "title": "Ethiopian Broadcasting Corporation Vacancy 2023",
            "url": "https://effoysira.com/ethiopian-broadcasting-corporation-vacancy-2023/",
            "date": "AUGUST 20, 2023",
            "from": "EFFOY",
            "content": "Ethiopian Broadcasting Corporation (EBC) Vacancy invites qualified and experienced applicants for the following positions. The Ethiopian Broadcasting Corporation, now rebranded as ETV, is an Ethiopian government-owned public service broadcaster. It is headquartered in Addis Ababa, Ethiopia, and is the country’s…"
        },
        {
            "title": "Embassy of Sweden Job Vacancy 2023",
            "url": "https://effoysira.com/embassy-of-sweden-job-vacancy-2023/",
            "date": "AUGUST 17, 2023",
            "from": "EFFOY",
            "content": "The Swedish Embassy in Addis Ababa is responsible for Sweden’s relations with Ethiopia, Djibouti and the African Union. Moreover, the Embassy manages both a Swedish bilateral development cooperation program with Ethiopia, as well as regional development cooperation in Africa. The…"
        },
        {
            "title": "Phoenix Telecom Vacancy Fresh Graduates 2023",
            "url": "https://effoysira.com/phoenix-telecom-vacancy-fresh-graduates-2023/",
            "date": "AUGUST 9, 2023",
            "from": "EFFOY",
            "content": "Phoenix Telecom would like to invite potential candidates who fulfill the job requirements for the following positions. Phoenix Distributors Ethiopia are based in Addis Ababa, Ethiopia, East Africa. Our company distributes FMCG products through our own network of Sales Representatives…"
        },
        {
            "title": "Liyu Micro Finance Vacancy 2023",
            "url": "https://effoysira.com/liyu-micro-finance-vacancy-2023/",
            "date": "AUGUST 8, 2023",
            "from": "EFFOY",
            "content": "Liyu Micro Finance Institution (LMFI) is a microfinancing institution, which is established in accordance with Proclamation No. 40/96 (Latr amended by 626/2009) issued by the National Bank of Ethiopia to regulate the business of microfinance in Ethiopia. LMFI is working…"
        },
        {
            "title": "Buusaa Gonofaa Microfinance Vacancy 2023",
            "url": "https://effoysira.com/buusaa-gonofaa-microfinance-vacancy-2023/",
            "date": "AUGUST 8, 2023",
            "from": "EFFOY",
            "content": "Buusaa Gonofaa Microfinance invites interested and qualified applicants for the following positions. Buusaa Gonofaa Microfinance S.C (BG MF S.C) was founded in 1999 and regulated by the National Bank of Ethiopia that provides a flexible and efficient financial service on…"
        },
        {
            "title": "Ethiopian Skylight Hotel Job Vacancy 2023",
            "url": "https://effoysira.com/ethiopian-skylight-hotel-job-vacancy-2023/",
            "date": "AUGUST 8, 2023",
            "from": "EFFOY",
            "content": "Ethiopian Skylight Hotel invites qualified applicants for following job positions. Ethiopian Skylight Hotel is Ethiopian Airlines Groups’ ultra-luxurious Five-Star hotel. The hotel was inaugurated on January 27, 2019. It has a total of 373 stunning rooms with relaxing and superb…"
        },
        {
            "title": "Habesha Cement Job Vacancy 2023",
            "url": "https://effoysira.com/habesha-cement-job-vacancy-2023/",
            "date": "AUGUST 5, 2023",
            "from": "EFFOY",
            "content": "Habesha Cement S.C invites interested and qualified applicants for the following job positions. Position 1: Cashier Accountant Qualification and Experience: Bachelor’s degree in Management, Accounting, Auditing and Finance and Business Administration or related fields with five (5) years of direct…"
        }
    ],
    [
        {
            "title": "Ethiopian News Agency Job Vacancy 2023",
            "url": "https://effoysira.com/ethiopian-news-agency-job-vacancy-2023/",
            "date": "JULY 29, 2023",
            "from": "EFFOY",
            "content": "Ethiopian News Agency invites Interested and qualified applicants for the following job Positions. The Ethiopian News Agency is the official news agency of the government of Ethiopia. It is the oldest news organisation in Ethiopia. Ethiopian News Agency is the sole…"
        },
        {
            "title": "Taxiye Savings & Credit Cooperative Vacancy 2023",
            "url": "https://effoysira.com/taxiye-savings-credit-cooperative-vacancy-2023/",
            "date": "JULY 26, 2023",
            "from": "EFFOY",
            "content": "Taxiye Savings & Credit Coop Sco with Lim Liab  would like to invites competent and interested candidates for the following position. This association was established with the intention to support the local community with financial aid for them to be…"
        },
        {
            "title": "Job Opening at Ethiopian Sky Technologies",
            "url": "https://effoysira.com/job-opening-at-ethiopian-sky-technologies/",
            "date": "JULY 22, 2023",
            "from": "EFFOY",
            "content": "Ethiopian Sky Technologies is a Joint Venture (JV) company of Ethiopian Airlines and Sky techno of Italy; which is engaged in manufacture insulation blankets and its primary manufacturing facility is at Bole Airport, Addis Ababa. Ethiopian Airlines and Geven-SkyTecno have…"
        },
        {
            "title": "Fana Broadcasting Corporate Vacancy 2023",
            "url": "https://effoysira.com/fana-broadcasting-corporate-vacancy-2023/",
            "date": "JULY 22, 2023",
            "from": "EFFOY",
            "content": "Fana Broadcasting Corporate would like to recruit Fresh graduates for the following vacant positions. Fana Broadcasting Corporate S.C. is a state-owned mass media company operating in Ethiopia. Launched in 1994 it focuses mostly on political, social and economical reports about…"
        },
        {
            "title": "Unity University Job Vacancy 2023",
            "url": "https://effoysira.com/unity-university-job-vacancy-2023/",
            "date": "JULY 20, 2023",
            "from": "EFFOY",
            "content": "Unity University invites interested and qualified applicants for the following positions. Unity University is the first full-fledged privately owned institute of higher learning in Ethiopia with a status granted by the Ministry of Education. It has vision to be the…"
        },
        {
            "title": "Huawei Technologies Job Vacancy 2023",
            "url": "https://effoysira.com/huawei-technologies-vacancy-2023/",
            "date": "JULY 20, 2023",
            "from": "EFFOY",
            "content": "Huawei Technologies Co., Ltd. is a Chinese multinational technology company. It provides telecommunications equipment and sells consumer electronics, smartphones and is headquartered in Shenzhen, Guangdong. The company was founded in 1987 by Ren Zhengfei. Huawei Technologies Ethiopia PLC invites competent and…"
        },
        {
            "title": "Biniget Group Job Vacancy 2023",
            "url": "https://effoysira.com/biniget-group-job-vacancy-2023/",
            "date": "JULY 19, 2023",
            "from": "EFFOY",
            "content": "Binget group is a private limited company established in 2018, which initially working in import and export business. Following the NBE new directive in April 2020 to allow nonbank players in the e-payments business, Binget group become one of the…"
        },
        {
            "title": "KYT Trading PLC Job Vacancy 2023",
            "url": "https://effoysira.com/kyt-trading-plc-job-vacancy-2023/",
            "date": "JULY 19, 2023",
            "from": "EFFOY",
            "content": "KYT Trading Pvt. Ltd. Company, whose trade name is AFROADDIS, is a rapidly growing commercial enterprise owned and run by a team of former diaspora executives. It has been operational since 2015. We are currently engaged in manufacturing, import, trading…"
        },
        {
            "title": "Addis Credit and Saving Institution S.C Vacancy 2023",
            "url": "https://effoysira.com/addis-credit-and-saving-institution-s-c-vacancy-2023-2/",
            "date": "JULY 17, 2023",
            "from": "EFFOY",
            "content": "Addis Credit and Saving Institution S.C Adcsi / is a Micro finance institution working in Addis Ababa and its surrounding Oromia Special Zone. The institution is aiming at giving financial service to prospective Customer so as to fill their financial…"
        }
    ],
    [
        {
            "title": "USAID Ethiopia Job Vacancy 2023",
            "url": "https://effoysira.com/usaid-job-vacancy-2023/",
            "date": "JULY 13, 2023",
            "from": "EFFOY",
            "content": "USAID/Ethiopia is one of the Agency’s largest and most complex programs. In FY 2020, the overall USAID assistance to Ethiopia totaled $2 billion, with the Health Office managing approximately $205 million by 56 staff. The Mission serves as one of…"
        },
        {
            "title": "Ethiopost Job Vacancy 2023",
            "url": "https://effoysira.com/ethiopost-job-vacancy-2023/",
            "date": "JULY 13, 2023",
            "from": "EFFOY",
            "content": "Ethiopost is Ethiopia’s principal postal service provider, with over 600 branches across the country. Ethiopost’s new vision is to be a global leader in postal services and a preferred partner in logistics, financial and government services. Ethiopost is a state-owned…"
        },
        {
            "title": "Murabaha Trading PLC Vacancy Fresh Graduates 2023",
            "url": "https://effoysira.com/murabaha-trading-plc-vacancy-fresh-graduates-2023/",
            "date": "JULY 6, 2023",
            "from": "EFFOY",
            "content": "Murabaha Trading PLC is one of the leading import and export company in Ethiopia. We export high-quality agricultural products to your country. We have different oilseeds, pulses, sesame seeds, soya beans, chickpeas, green mung bean, kidney beans and other beneficial…"
        },
        {
            "title": "Embassy of Canada Vacancy 2023",
            "url": "https://effoysira.com/embassy-of-canada-vacancy-2023/",
            "date": "JULY 6, 2023",
            "from": "EFFOY",
            "content": "The Government of Canada is an equal opportunities employer and welcomes applications from diverse sections of the community. Candidates will be considered based on merit. Our organization offers an inclusive workplace where respect, teamwork, and collaboration are part of our…"
        },
        {
            "title": "Esdros Construction Job Vacancy 2023",
            "url": "https://effoysira.com/esdros-construction-job-vacancy-2023/",
            "date": "JULY 4, 2023",
            "from": "EFFOY",
            "content": "Esdros Construction Trading Industries invites competent and interested candidates for the following positions. Esdros Construction Trade and Industry S.C is a company that engages in Education, Industry, Real State and Trade activities mainly focuses in shaping the upcoming generations with…"
        },
        {
            "title": "Hagbes PLC Job Vacancy 2023",
            "url": "https://effoysira.com/hagbes-plc-job-vacancy-2023/",
            "date": "JULY 4, 2023",
            "from": "EFFOY",
            "content": "Hagbes PLC Company invites competent and interested candidates for the following positions. Hagbes PLC was founded in 1957 as an importing & trading company for small agricultural machinery and building materials, becoming the pioneer to introduce stone grinding mills in…"
        },
        {
            "title": "German Embassy School Addis Ababa Vacancy 2023",
            "url": "https://effoysira.com/german-embassy-school-addis-ababa-vacancy-2023/",
            "date": "JULY 3, 2023",
            "from": "EFFOY",
            "content": "German Embassy School Addis Ababa invites qualified applicants for the following job position. The German Embassy School Addis Ababa, DBSAA for short, is located in the district of Aware, in the north-east of the Ethiopian capital. Roman Herzog, the then…"
        },
        {
            "title": "Ethiopian Ministry of Revenues Job Vacancy 2023",
            "url": "https://effoysira.com/ethiopian-ministry-of-revenues-job-vacancy-2023/",
            "date": "JULY 2, 2023",
            "from": "EFFOY",
            "content": "Ethiopian Ministry of Revenues invites qualified applicants for the following jobs. Candidates who have a diploma from a college or technical college should submit COC certificate and candidates who have a bachelor’s degree or diploma also must submit a diploma…"
        },
        {
            "title": "Addis Ababa Water and Sewerage Authority Vacancy 2023",
            "url": "https://effoysira.com/addis-ababa-water-and-sewerage-authority-vacancy-2023/",
            "date": "JUNE 30, 2023",
            "from": "EFFOY",
            "content": "Addis Ababa Water and Sewerage Authority invites competent and interested candidates for the following positions. Addis Ababa Water and Sewerage Service Authority was set up as per proclamation No. 68/1963, in 1963 E.C. (1971G.C.). And in 1987 E.C. (1995 G.C.)…"
        }
    ],
    [
        {
            "title": "Safaricom Ethiopia Job Vacancy 2023",
            "url": "https://effoysira.com/safaricom-ethiopia-job-vacancy-2023-2/",
            "date": "JUNE 30, 2023",
            "from": "EFFOY",
            "content": "On behalf of Safaricom Ethiopia, Soreti international trading would like to recruit applicants for the following vacancies in different locatiions s part of mster agent activity for safaricom M- PESA mobile money service in Ethiopia. About Safaricom Ethiopia Safaricom Ethiopia…"
        },
        {
            "title": "Deborah Foundation Job Vacancy 2023",
            "url": "https://effoysira.com/deborah-foundation-job-vacancy-2023/",
            "date": "JUNE 27, 2023",
            "from": "EFFOY",
            "content": "Deborah Foundation is a registered non-profit organization with a mission to improve the lives of children with Down syndrome and other intellectual disabilities through support in the areas of health Education, and Policy Advocacy, It is Established in 2019. Deborah…"
        },
        {
            "title": "Hidasie Telecom Job Vacancy 2023",
            "url": "https://effoysira.com/hidasie-telecom-job-vacancy-2023/",
            "date": "JUNE 26, 2023",
            "from": "EFFOY",
            "content": "Hidasie Telecom Share Company is a private national distributor of telecom products through its more than 800 shops across Ethiopia. Hidasie Telecom Share Company is incorporated in July 2011 by 2,508 shareholders with financial and other resource support from the…"
        },
        {
            "title": "Addis Ababa Roads Authority Vacancy 2023",
            "url": "https://effoysira.com/addis-ababa-roads-authority-vacancy-2023/",
            "date": "JUNE 22, 2023",
            "from": "EFFOY",
            "content": "Addis Ababa Road Authority wants to hire qualified applicants to the following position. Our capital, Addis Ababa, has undergone a series of renovations, including the construction of a ring road. In order to manage this internationally competitive ring road and other…"
        },
        {
            "title": "Ethiopia Roads Administration Vacancy 2023",
            "url": "https://effoysira.com/ethiopia-roads-administration-vacancy-2023/",
            "date": "JUNE 16, 2023",
            "from": "EFFOY",
            "content": "Ethiopia Roads Administration wants to hire fresh graduates and qualified applicants to the following positions. Ethiopian Road Authority (ERA) is a government body established in 1951 in Addis Ababa, Ethiopia that operates under the Ministry of Works and Urban Development…"
        },
        {
            "title": "ESHET Microfinance Vacancy 2023",
            "url": "https://effoysira.com/eshet-microfinance-vacancy-2023/",
            "date": "JUNE 16, 2023",
            "from": "EFFOY",
            "content": "ESHET Microfinance Institution SC would like to invite competent applicants for the following position. ESHET MICRO FINANCE INSTITUTION is located in Addis Ababa, Ethiopia. Company is working in Financial Activity business activities. ESHET is a microfinance institution created in 2000 by the…"
        },
        {
            "title": "Jambo Construction Plc Job Vacancy 2023",
            "url": "https://effoysira.com/jambo-construction-plc-job-vacancy-2023/",
            "date": "JUNE 9, 2023",
            "from": "EFFOY",
            "content": "Jambo Construction Plc and its subsidiaries are seeking highly motivated individuals to join the company in the following vacant posts. Jambo Real Estate is a young & robust firm established under Jambo Group (Consortium) in order to play exemplary role…"
        },
        {
            "title": "Canada Embassy Job Vacancy 2023",
            "url": "https://effoysira.com/canada-embassy-job-vacancy-2023/",
            "date": "JUNE 6, 2023",
            "from": "EFFOY",
            "content": "The Embassy of Canada in Ethiopia would like to invite qualified and experienced candidates for the following position. Position: African Union Political Specialist Education:   Experience: Language: Under the general supervision of the Head of the African Union Commission Liaison Unit in the …"
        },
        {
            "title": "Addis Ababa City Health Bureau Vacancy 2023",
            "url": "https://effoysira.com/addis-ababa-city-health-bureau-vacancy-2023/",
            "date": "JUNE 5, 2023",
            "from": "EFFOY",
            "content": "Addis Ababa City Administration Health Bureau invites Fresh and qualified candidates for the following positions.  Job Title 1: Upper Neck Specialist Physician I  Quantity required: 1  Work Experience: Zero years  Job Title 2: Plastic Surgery Specialist I  Quantity required: 1…"
        }
    ],
    [
        {
            "title": "US Embassy Addis Ababa Job Vacancy 2023",
            "url": "https://effoysira.com/us-embassy-addis-ababa-job-vacancy-2023/",
            "date": "MAY 31, 2023",
            "from": "EFFOY",
            "content": "The U.S. Mission in Addis Ababa/Ethiopia is seeking eligible and qualified applicants for the position of Logistics Team Lead (Supply Assistant). The U.S. Mission provides equal opportunity and fair and equitable treatment in employment to all people without regard to…"
        },
        {
            "title": "Komari Beverage Vacancy Data Collector",
            "url": "https://effoysira.com/komari-beverage-vacancy-data-collector/",
            "date": "MAY 30, 2023",
            "from": "EFFOY",
            "content": "Komari Beverage is young start-up drinks manufacturer preparing to introduce new and exciting brands to the East African market. Komari beverage plc was founded in March 2018, not long after two friends had a chat about the idea on a…"
        },
        {
            "title": "Wasasa Microfinance Vacancy 2023",
            "url": "https://effoysira.com/wasasa-microfinance-vacancy-2023/",
            "date": "MAY 26, 2023",
            "from": "EFFOY",
            "content": "Wasasa microfinance has been providing financial services to the poor communities since the year 2000. The company is now wants to recruit qualified and competent applicant on the following job position. Wasasa Microfinance S.C. was established by Oromo Self-Reliance Association…"
        },
        {
            "title": "Ethiopian Airlines Group Vacancy 2023",
            "url": "https://effoysira.com/ethiopian-airlines-group-vacancy-2023/",
            "date": "MAY 25, 2023",
            "from": "EFFOY",
            "content": "Ethiopian Airlines Group would like to announce a new vacant position in the capacity of Jr. Data Entry & Administrative Clerk and Junior Sales Representative. Position 1: Jr. Data Entry & Administrative Clerk QUALIFICATION REQUIREMENTS: A minimum of College Diploma/ 10+3/Level…"
        },
        {
            "title": "Habesha Cement Vacancy 2023",
            "url": "https://effoysira.com/habesha-cement-vacancy-2023/",
            "date": "MAY 25, 2023",
            "from": "EFFOY",
            "content": "HABESHA Cement Share Co. is an Ethiopian based cement manufacturing business incorporated in September 2008, producing OPC 42.5R and PPC 32.5N cements. Position 1: Junior Internal Auditor Qualification and Experience Bachelor’s degree Management, Accounting, Auditing, Finance, Taxation, and Business Administration…"
        },
        {
            "title": "Addis Ababa Revenues Authority Vacancy 2023",
            "url": "https://effoysira.com/addis-ababa-revenues-authority-vacancy-2023/",
            "date": "MAY 24, 2023",
            "from": "EFFOY",
            "content": "Addis Ababa Revenues Authority Office invites qualified applicants for the following job Vacancies. The Addis Ababa City Revenue Bureau has been tasked with administering the powers of the Revenue and Customs Authority since 2003 to 2010. It has been working…"
        },
        {
            "title": "DHL Job Vacancy Service Point Advisor",
            "url": "https://effoysira.com/dhl-job-vacancy-service-point-advisor/",
            "date": "MAY 20, 2023",
            "from": "EFFOY",
            "content": "DHL is the world’s leading logistics company. Our 395,000 people in over 220 countries and territories work every day to help you cross borders, reach new markets and grow your business. Or simply send a letter to your loved ones.…"
        },
        {
            "title": "Ethiopian Airlines Consumers Cooperating Society Vacancy 2023",
            "url": "https://effoysira.com/ethiopian-airlines-consumers-cooperating-society-vacancy-2023/",
            "date": "MAY 12, 2023",
            "from": "EFFOY",
            "content": "Ethiopian Consumers Cooperating Society Ltd (ECCS) is a company organized by Ethiopian Airlines employees as CONSUMERS COOPERATIVE – share company per cooperative society regulation of Ethiopia. It is involved in Food Processing & Wholesale / Retail business with a paid…"
        },
        {
            "title": "Premier Switch Solutions Vacancy May 2023",
            "url": "https://effoysira.com/premier-switch-solutions-vacancy-may-2023/",
            "date": "MAY 11, 2023",
            "from": "EFFOY",
            "content": "Premier Switch Solutions S.C. (PSS) is a leading Electronic Payment Processing Company, established by major private banks of Ethiopia. PSS is a consortium owned by six private banks i.e., Awash International Bank, Nib International Bank, United Bank, Berhan International Bank, Addis International…"
        }
    ],
    null,
    null,
    null,
    [
        {
            "title": "Ethiopian Skylight Hotel Vacancy 2023",
            "url": "https://effoysira.com/ethiopian-skylight-hotel-vacancy-2023/",
            "date": "JANUARY 21, 2023",
            "from": "EFFOY",
            "content": "Ethiopian Skylight Hotel invites qualified applicants for BILLING AND COLLECTION OFFICER, RESTAURANT / BAR MANAGER and MANAGER BANQUET job positions. Position 1: BILLING AND COLLECTION OFFICER EDUCATION & EXPERIENCE: BA Degree in Accounting/Accounting & Finance/Accounting Information System from recognized College/…"
        },
        {
            "title": "Engineering Corporation of Oromia Vacancy 2023",
            "url": "https://effoysira.com/engineering-corporation-of-oromia-vacancy-2023/",
            "date": "JANUARY 8, 2023",
            "from": "EFFOY",
            "content": "Engineering Corporation of Oromia Currently needs to select train and make ready for succession plan invites competent and qualified candidates on the following positions. Engineering Corporation of Oromia Has been engaging in planning, Study, Design, Construction Supervision and Contract Administration…"
        }
    ]
]